Revit 2027 API
SpecTypeId.Weight Property
 Weight, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Weight { get; }
Public Shared ReadOnly Property Weight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Weight {
	ForgeTypeId^ get ();
}
static member Weight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace